backend: tensorflow
class_name: Functional
config:
  input_layers:
  - - input_3
    - 0
    - 0
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - 32
      - 32
      - 3
      dtype: float32
      name: input_3
      ragged: false
      sparse: false
    inbound_nodes: []
    name: input_3
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id001 !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 8
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: &id003 !!python/tuple
      - 5
      - 5
      name: Conv2D__1
      padding: same
      strides: *id001
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: Conv2D__1
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: BatchNorm__1
      scale: true
      trainable: true
    inbound_nodes:
    - - - Conv2D__1
        - 0
        - 0
        - {}
    name: BatchNorm__1
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: MaxPool__1
      padding: same
      pool_size: &id002 !!python/tuple
      - 2
      - 2
      strides: *id002
      trainable: true
    inbound_nodes:
    - - - BatchNorm__1
        - 0
        - 0
        - {}
    name: MaxPool__1
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 12
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: *id003
      name: Conv2D__2
      padding: same
      strides: *id001
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - MaxPool__1
        - 0
        - 0
        - {}
    name: Conv2D__2
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: BatchNorm__2
      scale: true
      trainable: true
    inbound_nodes:
    - - - Conv2D__2
        - 0
        - 0
        - {}
    name: BatchNorm__2
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: MaxPool__2
      padding: same
      pool_size: *id002
      strides: *id002
      trainable: true
    inbound_nodes:
    - - - BatchNorm__2
        - 0
        - 0
        - {}
    name: MaxPool__2
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 16
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: *id003
      name: Conv2D__3
      padding: same
      strides: *id001
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - MaxPool__2
        - 0
        - 0
        - {}
    name: Conv2D__3
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: BatchNorm__3
      scale: true
      trainable: true
    inbound_nodes:
    - - - Conv2D__3
        - 0
        - 0
        - {}
    name: BatchNorm__3
  - class_name: UpSampling2D
    config:
      data_format: channels_last
      dtype: float32
      interpolation: nearest
      name: Upsampl__1
      size: *id002
      trainable: true
    inbound_nodes:
    - - - BatchNorm__3
        - 0
        - 0
        - {}
    name: Upsampl__1
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: BatchNorm__4
      scale: true
      trainable: true
    inbound_nodes:
    - - - Upsampl__1
        - 0
        - 0
        - {}
    name: BatchNorm__4
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_4
      trainable: true
    inbound_nodes:
    - - - BatchNorm__4
        - 0
        - 0
        - {}
    name: activation_4
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 12
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: *id003
      name: Conv2D__4
      padding: same
      strides: *id001
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_4
        - 0
        - 0
        - {}
    name: Conv2D__4
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: BatchNorm__5
      scale: true
      trainable: true
    inbound_nodes:
    - - - Conv2D__4
        - 0
        - 0
        - {}
    name: BatchNorm__5
  - class_name: UpSampling2D
    config:
      data_format: channels_last
      dtype: float32
      interpolation: nearest
      name: Upsampl__2
      size: *id002
      trainable: true
    inbound_nodes:
    - - - BatchNorm__5
        - 0
        - 0
        - {}
    name: Upsampl__2
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: BatchNorm__6
      scale: true
      trainable: true
    inbound_nodes:
    - - - Upsampl__2
        - 0
        - 0
        - {}
    name: BatchNorm__6
  - class_name: Activation
    config:
      activation: sigmoid
      dtype: float32
      name: activation_5
      trainable: true
    inbound_nodes:
    - - - BatchNorm__6
        - 0
        - 0
        - {}
    name: activation_5
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 3
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: *id003
      name: Conv2D__5
      padding: same
      strides: *id001
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_5
        - 0
        - 0
        - {}
    name: Conv2D__5
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: BatchNorm__7
      scale: true
      trainable: true
    inbound_nodes:
    - - - Conv2D__5
        - 0
        - 0
        - {}
    name: BatchNorm__7
  name: functional_5
  output_layers:
  - - BatchNorm__7
    - 0
    - 0
keras_version: 2.4.0
